src/META-INF/wsdl/fvsoluciones-001-site1.ftempurl.com/Service1.svc.singlewsdl.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="Service1" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/WSPorta"/><xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/"/><xs:element name="GetData"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="value" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetDataResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataUsingDataContract"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="composite" nillable="true" type="q1:CompositeType" xmlns:q1="http://schemas.datacontract.org/2004/07/WSPorta"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetDataUsingDataContractResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="GetDataUsingDataContractResult" nillable="true" type="q2:CompositeType" xmlns:q2="http://schemas.datacontract.org/2004/07/WSPorta"/></xs:sequence></xs:complexType></xs:element><xs:element name="getMaxPerona"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="getMaxPeronaResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="getMaxPeronaResult" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="LoginUsuario"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="pNombre" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="pPassword" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="LoginUsuarioResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="LoginUsuarioResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="getSexo"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="getSexoResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="getSexoResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="UpdateUserPass"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="pUsuario" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="pCorreo" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="pClave" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="UpdateUserPassResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="UpdateUserPassResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="InsertPers"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="pRut" type="xs:int"/><xs:element minOccurs="0" name="pNombres" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="pAp" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="pAm" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="pFechaN" type="xs:dateTime"/><xs:element minOccurs="0" name="pVigencia" type="q3:char" xmlns:q3="http://schemas.microsoft.com/2003/10/Serialization/"/><xs:element minOccurs="0" name="pSexo" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="InsertPersResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="InsertPersResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="CreaUser"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="pNombres" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="pClave" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="pVigencia" type="q4:char" xmlns:q4="http://schemas.microsoft.com/2003/10/Serialization/"/><xs:element minOccurs="0" name="pCorreo" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="pTusuario" type="xs:int"/><xs:element minOccurs="0" name="pPersona" type="xs:int"/></xs:sequence></xs:complexType></xs:element><xs:element name="CreaUserResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="CreaUserResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/WSPorta" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/WSPorta"><xs:complexType name="CompositeType"><xs:sequence><xs:element minOccurs="0" name="BoolValue" type="xs:boolean"/><xs:element minOccurs="0" name="StringValue" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="CompositeType" nillable="true" type="tns:CompositeType"/></xs:schema></wsdl:types><wsdl:message name="IService1_GetData_InputMessage"><wsdl:part name="parameters" element="tns:GetData"/></wsdl:message><wsdl:message name="IService1_GetData_OutputMessage"><wsdl:part name="parameters" element="tns:GetDataResponse"/></wsdl:message><wsdl:message name="IService1_GetDataUsingDataContract_InputMessage"><wsdl:part name="parameters" element="tns:GetDataUsingDataContract"/></wsdl:message><wsdl:message name="IService1_GetDataUsingDataContract_OutputMessage"><wsdl:part name="parameters" element="tns:GetDataUsingDataContractResponse"/></wsdl:message><wsdl:message name="IService1_getMaxPerona_InputMessage"><wsdl:part name="parameters" element="tns:getMaxPerona"/></wsdl:message><wsdl:message name="IService1_getMaxPerona_OutputMessage"><wsdl:part name="parameters" element="tns:getMaxPeronaResponse"/></wsdl:message><wsdl:message name="IService1_LoginUsuario_InputMessage"><wsdl:part name="parameters" element="tns:LoginUsuario"/></wsdl:message><wsdl:message name="IService1_LoginUsuario_OutputMessage"><wsdl:part name="parameters" element="tns:LoginUsuarioResponse"/></wsdl:message><wsdl:message name="IService1_getSexo_InputMessage"><wsdl:part name="parameters" element="tns:getSexo"/></wsdl:message><wsdl:message name="IService1_getSexo_OutputMessage"><wsdl:part name="parameters" element="tns:getSexoResponse"/></wsdl:message><wsdl:message name="IService1_UpdateUserPass_InputMessage"><wsdl:part name="parameters" element="tns:UpdateUserPass"/></wsdl:message><wsdl:message name="IService1_UpdateUserPass_OutputMessage"><wsdl:part name="parameters" element="tns:UpdateUserPassResponse"/></wsdl:message><wsdl:message name="IService1_InsertPers_InputMessage"><wsdl:part name="parameters" element="tns:InsertPers"/></wsdl:message><wsdl:message name="IService1_InsertPers_OutputMessage"><wsdl:part name="parameters" element="tns:InsertPersResponse"/></wsdl:message><wsdl:message name="IService1_CreaUser_InputMessage"><wsdl:part name="parameters" element="tns:CreaUser"/></wsdl:message><wsdl:message name="IService1_CreaUser_OutputMessage"><wsdl:part name="parameters" element="tns:CreaUserResponse"/></wsdl:message><wsdl:portType name="IService1"><wsdl:operation name="GetData"><wsdl:input wsaw:Action="http://tempuri.org/IService1/GetData" message="tns:IService1_GetData_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/GetDataResponse" message="tns:IService1_GetData_OutputMessage"/></wsdl:operation><wsdl:operation name="GetDataUsingDataContract"><wsdl:input wsaw:Action="http://tempuri.org/IService1/GetDataUsingDataContract" message="tns:IService1_GetDataUsingDataContract_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/GetDataUsingDataContractResponse" message="tns:IService1_GetDataUsingDataContract_OutputMessage"/></wsdl:operation><wsdl:operation name="getMaxPerona"><wsdl:input wsaw:Action="http://tempuri.org/IService1/getMaxPerona" message="tns:IService1_getMaxPerona_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/getMaxPeronaResponse" message="tns:IService1_getMaxPerona_OutputMessage"/></wsdl:operation><wsdl:operation name="LoginUsuario"><wsdl:input wsaw:Action="http://tempuri.org/IService1/LoginUsuario" message="tns:IService1_LoginUsuario_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/LoginUsuarioResponse" message="tns:IService1_LoginUsuario_OutputMessage"/></wsdl:operation><wsdl:operation name="getSexo"><wsdl:input wsaw:Action="http://tempuri.org/IService1/getSexo" message="tns:IService1_getSexo_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/getSexoResponse" message="tns:IService1_getSexo_OutputMessage"/></wsdl:operation><wsdl:operation name="UpdateUserPass"><wsdl:input wsaw:Action="http://tempuri.org/IService1/UpdateUserPass" message="tns:IService1_UpdateUserPass_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/UpdateUserPassResponse" message="tns:IService1_UpdateUserPass_OutputMessage"/></wsdl:operation><wsdl:operation name="InsertPers"><wsdl:input wsaw:Action="http://tempuri.org/IService1/InsertPers" message="tns:IService1_InsertPers_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/InsertPersResponse" message="tns:IService1_InsertPers_OutputMessage"/></wsdl:operation><wsdl:operation name="CreaUser"><wsdl:input wsaw:Action="http://tempuri.org/IService1/CreaUser" message="tns:IService1_CreaUser_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IService1/CreaUserResponse" message="tns:IService1_CreaUser_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IService1" type="tns:IService1"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetData"><soap:operation soapAction="http://tempuri.org/IService1/GetData" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetDataUsingDataContract"><soap:operation soapAction="http://tempuri.org/IService1/GetDataUsingDataContract" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="getMaxPerona"><soap:operation soapAction="http://tempuri.org/IService1/getMaxPerona" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="LoginUsuario"><soap:operation soapAction="http://tempuri.org/IService1/LoginUsuario" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="getSexo"><soap:operation soapAction="http://tempuri.org/IService1/getSexo" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="UpdateUserPass"><soap:operation soapAction="http://tempuri.org/IService1/UpdateUserPass" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="InsertPers"><soap:operation soapAction="http://tempuri.org/IService1/InsertPers" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="CreaUser"><soap:operation soapAction="http://tempuri.org/IService1/CreaUser" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="Service1"><wsdl:port name="BasicHttpBinding_IService1" binding="tns:BasicHttpBinding_IService1"><soap:address location="http://fvsoluciones-001-site1.ftempurl.com/Service1.svc"/></wsdl:port></wsdl:service></wsdl:definitions>